## 常见方式
常见的winowsC盘清理方式，一般就是如下几种
1. 第三方工具
2. 磁盘清理
3. C盘扩容
4. 换个硬盘 - 土豪

但是，这几种办法也都有各自的问题

* 第三方工具，可靠性存疑，万一出问题你人都傻了，而且三方工具也只是其他方式的傻瓜化执行而已
* 磁盘清理实际上能清理出来的空间是及其有限的
* 扩容无法应用在固态硬盘作为系统盘的问题
* 土豪换硬盘需要重装系统，无需重装系统的方式又过于麻烦

我的电脑就是用固态硬盘作为系统盘，时间一久，C盘的清理就成了问题，以上几种办法，都无法解决我的需求，于是，机智的我，开发了另外一个解决方案！

今天，就给大家分享一个C盘空间清理终极解决方案：
## （link）软连接！
简单说，按照如下步骤操作即可（也许会提示需要管理员权限，右键选择【以管理员身份运行】即可）：
1. 打开c盘，找到User，找到你常用的用户名(这里一般大家都是 `Administrator`)
	> 这一步你找到了你自己的文件在C盘中的安装路径，例如：`C:\Users\Administrator`

2. 找到路径中相对较大的那个文件夹
	> 右键文件夹查看属性即可，例如我找到的`android`文件夹，大小20G

3. 打开你其他盘符中剩余空间最大的那个盘符，在其中新建文件夹`Users`
	> 我这边是使用的`F`盘

4. 把第二步找到的那个文件夹，剪切到第三步新建的`Users`文件夹中
	> 至此：我把`C:\Users\Administrator\android` 剪切到了 `F:\Users\android` 

5. 最后一步：按`win+R`，在弹出框中输入`cmd`打开终端，在终端中输入
`mklink /d C:\Users\Administrator\android F:\Users\android`


至此，我们便完成了C盘20G空间的清理，因为C盘使用的android实际是使用的F盘中的文件,C盘中只是一个软连接，并没有真正占用C盘空间。

**重点：此方法是可以重复使用的，C盘永远不怕满了。**